ken-feng/FIT_smartaccess/board/pin_mux.c
    PORTB->PCR[18] = ((PORTB->PCR[18] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                      | (uint32_t)(PORT_PCR_PE_MASK));

    #endif

    //==========================================================================
    // SW3 - Setting
    //==========================================================================
	#if defined __HW_VENUS_EVT1_H

	#else
    //--------------------------------------------------------------------------
    // Config
    //--------------------------------------------------------------------------
    gpio_pin_config_t SW3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC2 (pin 38)  */
    GPIO_PinInit(BOARD_INITBUTTONS_SW3_GPIO, BOARD_INITBUTTONS_SW3_PIN, &SW3_config);
    //--------------------------------------------------------------------------
    // Pin Setting
    //--------------------------------------------------------------------------
    /* PORTC2 (pin 38) is configured as PTC2 */
    PORT_SetPinMux(BOARD_INITBUTTONS_SW3_PORT, BOARD_INITBUTTONS_SW3_PIN, kPORT_MuxAsGpio);

    //Modify (Ken):NXP-V0001 NO.1 -20240304
    #ifdef __HW_BLE_UWB_FOB_H
    PORTB->PCR[BOARD_INITBUTTONS_SW3_PIN] = ((PORTB->PCR[BOARD_INITBUTTONS_SW3_PIN] &
    #else
    PORTC->PCR[2] = ((PORTC->PCR[2] &
    #endif
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                     | (uint32_t)(PORT_PCR_PE_MASK));
	#endif
}
                      
                      

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPI0Pin
 * Description   : Init SPI0 pins, CS pin will be manually controlled for SPI .
 *
 * END ****************************************************************************************************************/
//Modify (Ken):NXP-V0001 NO.1 -20240304
void BOARD_InitSPI0Pins(void)
{
//Modify (Ken):NXP-V0001 NO.1 -20240304
#if defined __HW_BLE_UWB_G2_H || defined __HW_BLE_UWB_FOB_H || defined __HW_VENUS_EVT1_H

#else
    /* Enable Clocks: Port C Gate Control */
    CLOCK_EnableClock(kCLOCK_PortC);
    
    /* SPI0_SCK: PORTC16 (pin 45) */
    PORT_SetPinMux(BOARD_SPI0_CLK_PORT, BOARD_SPI0_CLK_PIN, kPORT_MuxAlt2);
    /* SPI0_SOUT: PORTC17 (pin 46) */
    PORT_SetPinMux(BOARD_SPI0_MISO_PORT, BOARD_SPI0_MISO_PIN, kPORT_MuxAlt2);
    /* SPI0_SIN: PORTC18 (pin 47) */
    PORT_SetPinMux(BOARD_SPI0_MOSI_PORT, BOARD_SPI0_MOSI_PIN, kPORT_MuxAlt2);
    /* SPI0_CS: PORTC19 (pin 48) */
    PORT_SetPinMux(BOARD_SPI0_CS_PORT, BOARD_SPI0_CS_PIN, kPORT_MuxAlt2);      
#endif
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPI1Pin
 * Description   : Init SPI0 pins, CS pin will be manually controlled for SPI.
 *                 
 * END ****************************************************************************************************************/
//Modify (Ken):NXP-V0001 NO.1 -20240304
void BOARD_InitSPI1Pins(void)
{
//Modify (Ken):NXP-V0001 NO.1 -20240304
#if defined __HW_BLE_UWB_G2_H || defined __HW_BLE_UWB_FOB_H || defined __HW_VENUS_EVT1_H
    /* Enable Clocks: Port A Gate Control */
    CLOCK_EnableClock(kCLOCK_PortA);
    
    /* SPI1_SOUT: PORTA16 (pin 4) */
    PORT_SetPinMux(BOARD_SPI1_MISO_PORT, BOARD_SPI1_MISO_PIN, kPORT_MuxAlt2);
    /* SPI1_SIN: PORTA17 (pin 5) */
    PORT_SetPinMux(BOARD_SPI1_MOSI_PORT, BOARD_SPI1_MOSI_PIN, kPORT_MuxAlt2);
    /* SPI1_SCK: PORTA18 (pin 6) */
    PORT_SetPinMux(BOARD_SPI1_CLK_PORT, BOARD_SPI1_CLK_PIN, kPORT_MuxAlt2);
    /* SPI0_CS: PORTA19 (pin 7) */
    //PORT_SetPinMux(PORTC, PIN19_IDX, kPORT_MuxAlt2);      
#endif
}

                      
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlexcan
 * Description   : FlexCAN Initialize Pins for CAN Communication
 *
 * END ****************************************************************************************************************/
//Modify (Ken):NXP-V0001 NO.1 -20240304
void BOARD_InitFlexcan(void)
{
#if FLEXCAN_SUPPORT
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    /* PORTC3 (pin 39) is configured as CAN0_TX */
    PORT_SetPinMux(BOARD_INITFLEXCAN_CAN0_TX_PORT, BOARD_INITFLEXCAN_CAN0_TX_PIN, kPORT_MuxAlt9);

    /* PORTC4 (pin 40) is configured as CAN0_RX */
    PORT_SetPinMux(BOARD_INITFLEXCAN_CAN0_RX_PORT, BOARD_INITFLEXCAN_CAN0_RX_PIN, kPORT_MuxAlt9);
    
    //=================================================================================================================
    // Add STB pin (Normal mode=low; Sleep mode=high)
    //=================================================================================================================
    #if defined __HW_BLE_UWB_FOB_H || defined __HW_BLE_UWB_G2_H || defined __HW_VENUS_EVT1_H
    CLOCK_EnableClock(kCLOCK_PortC);
    PORT_SetPinMux(BOARD_INITFLEXCAN_CAN0_STB_PORT, BOARD_INITFLEXCAN_CAN0_STB_PIN, kPORT_MuxAsGpio);
    GPIO_PinInit(BOARD_INITFLEXCAN_CAN0_STB_GPIO, BOARD_INITFLEXCAN_CAN0_STB_PIN, &(gpio_pin_config_t){kGPIO_DigitalOutput, 0U});
//    PORT_SetPinMux(BOARD_INITFLEXCAN_CAN0_STB_PORT, BOARD_INITFLEXCAN_CAN0_STB_PIN, kPORT_MuxAsGpio);
//    port_pin_config_t stbPinconfig =
//    {
//        kPORT_PullDown,         //Frank add STB : Normal = PullUp;Standby = PullDown
//        kPORT_FastSlewRate,
//        kPORT_PassiveFilterEnable,
//        kPORT_LowDriveStrength,
//        kPORT_MuxAsGpio
//    };
//    PORT_SetPinConfig(BOARD_INITFLEXCAN_CAN0_STB_PORT, BOARD_INITFLEXCAN_CAN0_STB_PIN, &stbPinconfig);
//
//    gpio_pin_config_t stbPinGPIOConfig =
//    {
//        .outputLogic = 0u,
//        .pinDirection = kGPIO_DigitalInput
//    };
//    GPIO_PinInit(BOARD_INITFLEXCAN_CAN0_STB_GPIO, BOARD_INITFLEXCAN_CAN0_STB_PIN, &stbPinGPIOConfig);
    #endif
#endif
}
                                              
