ken-feng/FIT_smartaccess/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitRanger4Pins
 * Description   : Init UWB module connected Pins
 *
 * END ****************************************************************************************************************/
void BOARD_InitRanger4Pins(void)
{
#if UWB_FEATURE_SUPPORT    
    //==========================================================================
    // SPI Init
    //==========================================================================
    #if defined __HW_BLE_UWB_FOB_H || defined __HW_BLE_UWB_G2_H || defined __HW_VENUS_EVT1_H
    BOARD_InitSPI1Pins();
    #else
    BOARD_InitSPI0Pins();
    #endif
    
    //==========================================================================
    // Enable Clocks
    //==========================================================================
    /* Enable Clocks: Port A Gate Control */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Enable Clocks: Port C Gate Control */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Enable Clocks: Port C Gate Control */
    CLOCK_EnableClock(kCLOCK_PortC);
    //==========================================================================
    /*** Manual chip select (CS): PORTA19 output***/
    //==========================================================================
    PORT_SetPinMux(BOARD_UWB_CS_PORT, BOARD_UWB_CS_PIN, kPORT_MuxAsGpio);
    port_pin_config_t csPinconfig =
    {
        kPORT_PullDisable,
        kPORT_FastSlewRate,
        kPORT_PassiveFilterDisable,
        kPORT_LowDriveStrength,
        kPORT_MuxAsGpio
    };
    PORT_SetPinConfig(BOARD_UWB_CS_PORT, BOARD_UWB_CS_PIN, &csPinconfig);
    gpio_pin_config_t csPinGPIOConfig =
    {
        .outputLogic = 1u, 
        .pinDirection = kGPIO_DigitalOutput
    };
    GPIO_PinInit(BOARD_UWB_CS_GPIO, BOARD_UWB_CS_PIN, &csPinGPIOConfig);
    
    //==========================================================================
    /*** Ready pin(RDY): PORTC5 input***/
    //==========================================================================
    PORT_SetPinMux(BOARD_UWB_RDY_PORT, BOARD_UWB_RDY_PIN, kPORT_MuxAsGpio);
    port_pin_config_t readyPinconfig =
    {
        kPORT_PullUp,
        kPORT_FastSlewRate,
        kPORT_PassiveFilterEnable,
        kPORT_LowDriveStrength,
        kPORT_MuxAsGpio
    };
    PORT_SetPinConfig(BOARD_UWB_RDY_PORT, BOARD_UWB_RDY_PIN, &readyPinconfig);
    
    gpio_pin_config_t readyPinGPIOConfig =
    {
        .outputLogic = 1u,
        .pinDirection = kGPIO_DigitalInput
    };
    GPIO_PinInit(BOARD_UWB_RDY_GPIO, BOARD_UWB_RDY_PIN, &readyPinGPIOConfig);
    
    //==========================================================================
    /*** Reset pin(RST): PORTC19 output***/
    //==========================================================================
    PORT_SetPinMux(BOARD_UWB_RST_PORT, BOARD_UWB_RST_PIN, kPORT_MuxAsGpio);
    port_pin_config_t rstPinconfig =
    {
        #if defined __HW_BLE_UWB_FOB_H || defined __HW_BLE_UWB_G2_H || defined __HW_VENUS_EVT1_H
        kPORT_PullUp,
        #else
        kPORT_PullDisable,
        #endif
        kPORT_FastSlewRate,
        kPORT_PassiveFilterDisable,
        kPORT_LowDriveStrength,
        kPORT_MuxAsGpio
    };
    PORT_SetPinConfig(BOARD_UWB_RST_PORT, BOARD_UWB_RST_PIN, &rstPinconfig);
    gpio_pin_config_t rstPinGPIOConfig =
    {
        .outputLogic = 1u,
        .pinDirection = kGPIO_DigitalOutput
    };
    GPIO_PinInit(BOARD_UWB_RST_GPIO, BOARD_UWB_RST_PIN, &rstPinGPIOConfig);
    
    //==========================================================================
    /*** Interrupt pin: PORTC6 input***/
    //==========================================================================
    // This port not use now. Because this port also be used by LpUart0, so 
    // it should be initlized after LpUart0 was initlized.  
    PORT_SetPinMux(BOARD_UWB_INt_PORT, BOARD_UWB_INT_PIN, kPORT_MuxAsGpio);
    port_pin_config_t intPinconfig =
    {
        kPORT_PullUp,
        kPORT_FastSlewRate,
        kPORT_PassiveFilterEnable,
        kPORT_LowDriveStrength,
        kPORT_MuxAsGpio
    };
    PORT_SetPinConfig(BOARD_UWB_INt_PORT, BOARD_UWB_INT_PIN, &intPinconfig);

    gpio_pin_config_t intPinGPIOConfig =
    {
        .outputLogic = 1u,
        .pinDirection = kGPIO_DigitalInput
    };
    GPIO_PinInit(BOARD_UWB_INT_GPIO, BOARD_UWB_INT_PIN, &intPinGPIOConfig);
#endif
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
